Hybrid-Memcached-(with-aggre)/ex3_result/memtier_6t_16t_default_datasize_50_cycle_10_result
16        Threads
50        Connections per thread
120       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       182639.26          ---          ---         4.37269         4.04700         8.57500        19.45500     16230.64 
Gets          179.66       179.66         0.00         4.32574         4.03100         8.38300        18.94300        19.65 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     182818.92       179.66         0.00         4.37265         4.04700         8.57500        19.45500     16250.29 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.071        0.000
SET       3.631        5.000
SET       3.727       10.000
SET       3.791       15.000
SET       3.839       20.000
SET       3.871       25.000
SET       3.919       30.000
SET       3.951       35.000
SET       3.983       40.000
SET       4.015       45.000
SET       4.047       50.000
SET       4.063       52.500
SET       4.095       55.000
SET       4.127       57.500
SET       4.159       60.000
SET       4.191       62.500
SET       4.223       65.000
SET       4.255       67.500
SET       4.319       70.000
SET       4.383       72.500
SET       4.447       75.000
SET       4.479       76.250
SET       4.543       77.500
SET       4.607       78.750
SET       4.703       80.000
SET       4.799       81.250
SET       4.895       82.500
SET       5.023       83.750
SET       5.087       85.000
SET       5.183       86.250
SET       5.247       87.500
SET       5.279       88.125
SET       5.343       88.750
SET       5.375       89.375
SET       5.407       90.000
SET       5.471       90.625
SET       5.535       91.250
SET       5.599       91.875
SET       5.663       92.500
SET       5.759       93.125
SET       5.823       93.750
SET       5.887       94.062
SET       5.919       94.375
SET       5.983       94.688
SET       6.047       95.000
SET       6.111       95.312
SET       6.207       95.625
SET       6.303       95.938
SET       6.399       96.250
SET       6.527       96.562
SET       6.687       96.875
SET       6.751       97.031
SET       6.879       97.188
SET       6.975       97.344
SET       7.103       97.500
SET       7.231       97.656
SET       7.391       97.812
SET       7.487       97.969
SET       7.615       98.125
SET       7.711       98.281
SET       7.807       98.438
SET       7.871       98.516
SET       7.935       98.594
SET       8.031       98.672
SET       8.095       98.750
SET       8.255       98.828
SET       8.383       98.906
SET       8.575       98.984
SET       8.703       99.062
SET       8.895       99.141
SET       9.151       99.219
SET       9.279       99.258
SET       9.407       99.297
SET       9.599       99.336
SET       9.791       99.375
SET      10.047       99.414
SET      10.303       99.453
SET      10.687       99.492
SET      11.135       99.531
SET      11.647       99.570
SET      12.223       99.609
SET      12.479       99.629
SET      12.799       99.648
SET      13.183       99.668
SET      13.567       99.688
SET      13.951       99.707
SET      14.335       99.727
SET      14.783       99.746
SET      15.231       99.766
SET      15.807       99.785
SET      16.255       99.805
SET      16.639       99.814
SET      16.895       99.824
SET      17.151       99.834
SET      17.407       99.844
SET      17.791       99.854
SET      18.047       99.863
SET      18.431       99.873
SET      18.815       99.883
SET      19.199       99.893
SET      19.583       99.902
SET      19.839       99.907
SET      20.095       99.912
SET      20.223       99.917
SET      20.479       99.922
SET      20.735       99.927
SET      21.119       99.932
SET      21.375       99.937
SET      21.631       99.941
SET      22.015       99.946
SET      22.399       99.951
SET      22.527       99.954
SET      22.783       99.956
SET      23.039       99.958
SET      23.295       99.961
SET      23.551       99.963
SET      23.807       99.966
SET      24.063       99.968
SET      24.319       99.971
SET      24.703       99.973
SET      25.087       99.976
SET      25.343       99.977
SET      25.599       99.978
SET      25.983       99.979
SET      26.367       99.980
SET      26.879       99.982
SET      27.775       99.983
SET      29.567       99.984
SET      68.607       99.985
SET      77.311       99.987
SET      81.919       99.988
SET      83.967       99.988
SET      86.527       99.989
SET      89.599       99.990
SET     108.031       99.990
SET     115.199       99.991
SET     119.807       99.991
SET     126.975       99.992
SET     134.143       99.993
SET     145.407       99.993
SET     152.575       99.994
SET     154.623       99.994
SET     156.671       99.995
SET     157.695       99.995
SET     158.719       99.995
SET     159.743       99.995
SET     160.767       99.996
SET     162.815       99.996
SET     163.839       99.996
SET     165.887       99.997
SET     167.935       99.997
SET     171.007       99.997
SET     174.079       99.997
SET     247.807       99.997
SET     254.975       99.998
SET     262.143       99.998
SET     270.335       99.998
SET     280.575       99.998
SET     290.815       99.998
SET     305.151       99.998
SET     315.391       99.998
SET     323.583       99.999
SET     329.727       99.999
SET     337.919       99.999
SET     346.111       99.999
SET     354.303       99.999
SET     362.495       99.999
SET     368.639       99.999
SET     378.879       99.999
SET     387.071       99.999
SET     395.263       99.999
SET     401.407       99.999
SET     405.503       99.999
SET     409.599       99.999
SET     415.743       99.999
SET     419.839       99.999
SET     425.983       99.999
SET     430.079      100.000
SET     436.223      100.000
SET     442.367      100.000
SET     446.463      100.000
SET     448.511      100.000
SET     452.607      100.000
SET     452.607      100.000
SET     456.703      100.000
SET     458.751      100.000
SET     462.847      100.000
SET     464.895      100.000
SET     466.943      100.000
SET     473.087      100.000
SET     475.135      100.000
SET     475.135      100.000
SET     477.183      100.000
SET     479.231      100.000
SET     479.231      100.000
SET     481.279      100.000
SET     483.327      100.000
SET     483.327      100.000
SET     485.375      100.000
SET     487.423      100.000
SET     489.471      100.000
SET     489.471      100.000
SET     491.519      100.000
SET     491.519      100.000
SET     493.567      100.000
SET     497.663      100.000
SET     497.663      100.000
SET     501.759      100.000
SET     501.759      100.000
SET     505.855      100.000
SET     511.999      100.000
SET     518.143      100.000
SET     518.143      100.000
SET     520.191      100.000
SET     520.191      100.000
SET     524.287      100.000
SET     524.287      100.000
SET     528.383      100.000
SET     528.383      100.000
SET     528.383      100.000
[...]
SET     532.479      100.000
SET     532.479      100.000
SET     532.479      100.000
[...]
SET     536.575      100.000
SET     536.575      100.000
SET     536.575      100.000
[...]
SET     540.671      100.000
SET     540.671      100.000
SET     540.671      100.000
[...]
SET     544.767      100.000
SET     544.767      100.000
---
GET       0.239        0.000
GET       3.631        5.000
GET       3.727       10.000
GET       3.775       15.000
GET       3.823       20.000
GET       3.871       25.000
GET       3.903       30.000
GET       3.935       35.000
GET       3.967       40.000
GET       3.999       45.000
GET       4.031       50.000
GET       4.047       52.500
GET       4.079       55.000
GET       4.095       57.500
GET       4.127       60.000
GET       4.159       62.500
GET       4.191       65.000
GET       4.223       67.500
GET       4.287       70.000
GET       4.319       72.500
GET       4.383       75.000
GET       4.415       76.250
GET       4.479       77.500
GET       4.511       78.750
GET       4.575       80.000
GET       4.671       81.250
GET       4.799       82.500
GET       4.895       83.750
GET       5.023       85.000
GET       5.087       86.250
GET       5.183       87.500
GET       5.215       88.125
GET       5.247       88.750
GET       5.279       89.375
GET       5.343       90.000
GET       5.375       90.625
GET       5.407       91.250
GET       5.471       91.875
GET       5.535       92.500
GET       5.599       93.125
GET       5.663       93.750
GET       5.727       94.062
GET       5.759       94.375
GET       5.791       94.688
GET       5.855       95.000
GET       5.919       95.312
GET       6.015       95.625
GET       6.111       95.938
GET       6.207       96.250
GET       6.367       96.562
GET       6.559       96.875
GET       6.623       97.031
GET       6.751       97.188
GET       6.879       97.344
GET       6.975       97.500
GET       7.103       97.656
GET       7.295       97.812
GET       7.391       97.969
GET       7.519       98.125
GET       7.615       98.281
GET       7.711       98.438
GET       7.743       98.516
GET       7.839       98.594
GET       7.903       98.672
GET       7.967       98.750
GET       8.095       98.828
GET       8.255       98.906
GET       8.383       98.984
GET       8.511       99.062
GET       8.767       99.141
GET       8.959       99.219
GET       9.023       99.258
GET       9.151       99.297
GET       9.215       99.336
GET       9.407       99.375
GET       9.471       99.414
GET       9.663       99.453
GET       9.919       99.492
GET      10.239       99.531
GET      10.751       99.570
GET      11.007       99.609
GET      11.327       99.629
GET      11.455       99.648
GET      11.839       99.668
GET      11.967       99.688
GET      12.159       99.707
GET      12.799       99.727
GET      13.311       99.746
GET      14.335       99.766
GET      15.039       99.785
GET      15.807       99.805
GET      15.871       99.814
GET      16.255       99.824
GET      16.511       99.834
GET      16.639       99.844
GET      17.663       99.854
GET      17.663       99.863
GET      17.791       99.873
GET      18.047       99.883
GET      18.815       99.893
GET      19.071       99.902
GET      19.071       99.907
GET      19.199       99.912
GET      19.327       99.917
GET      19.455       99.922
GET      19.711       99.927
GET      20.095       99.932
GET      20.607       99.937
GET      20.863       99.941
GET      21.375       99.946
GET      21.375       99.951
GET      21.375       99.954
GET      22.015       99.956
GET      22.015       99.958
GET      22.015       99.961
GET      22.399       99.963
GET      22.399       99.966
GET      23.295       99.968
GET      23.295       99.971
GET      23.551       99.973
GET      23.551       99.976
GET      23.551       99.977
GET      25.471       99.978
GET      25.471       99.979
GET      25.471       99.980
GET      25.599       99.982
GET      25.599       99.983
GET      25.599       99.984
GET      25.599       99.985
GET      80.895       99.987
GET      80.895       99.988
GET      80.895       99.988
GET      80.895       99.989
GET      80.895       99.990
GET      80.895       99.990
GET     110.591       99.991
GET     110.591       99.991
GET     110.591       99.992
GET     110.591       99.993
GET     110.591       99.993
GET     110.591       99.994
GET     110.591       99.994
GET     110.591       99.995
GET     110.591       99.995
GET     110.591       99.995
GET     115.199       99.995
GET     115.199      100.000
---
WAIT      0.000      100.000